#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* engine
#include <Engine/Foundation.h>

//* windows
#include <windows.h>

//* c++
#include <filesystem>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// CrashHandler class
////////////////////////////////////////////////////////////////////////////////////////////
//! @brief 未処理例外/クラッシュを捕捉し, クラッシュダンプやログを出力するハンドラ
class CrashHandler final {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	static void Install();

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	//* file *//

	static inline const std::filesystem::path kDirectory = "Dumps";
	static const std::filesystem::path kFilename;

	//=========================================================================================
	// private methods
	//=========================================================================================

	static LONG WINAPI UnhandledExceptionFilterFunc(EXCEPTION_POINTERS* exception);

	static std::filesystem::path GetDumpFilename();

};

SXAVENGER_ENGINE_NAMESPACE_END
