#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* DXOBJECT
#include "DxObjectCommon.h"

//* externals
#include <magic_enum.hpp>

//* c++
#include <array>

////////////////////////////////////////////////////////////////////////////////////////////
// BlendMode enum class
////////////////////////////////////////////////////////////////////////////////////////////
enum class BlendMode : uint8_t {
	kBlendModeNone,            //!< ブレンドなし
	kBlendModeNormal,          //!< 通常αブレンド
	kBlendModeNormal_AlphaMax, //!< αブレンド(アルファ最大)
	kBlendModeAdd,             //!< 加算
	kBlendModeSubtract,        //!< 減算
	kBlendModeMultiply,        //!< 乗算
	kBlendModeScreen           //!< スクリーン
};


////////////////////////////////////////////////////////////////////////////////////////////
// DXOBJECT
////////////////////////////////////////////////////////////////////////////////////////////
_DXOBJECT_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// BlendState class
////////////////////////////////////////////////////////////////////////////////////////////
//! @brief 共通BlendState設定クラス
class BlendState {
public:

	//=========================================================================================
	// public method
	//=========================================================================================

	static const D3D12_RENDER_TARGET_BLEND_DESC& GetDesc(BlendMode mode) { return descs_[static_cast<uint32_t>(mode)]; }

private:

	//=========================================================================================
	// private methods
	//=========================================================================================

	static std::array<D3D12_RENDER_TARGET_BLEND_DESC, magic_enum::enum_count<BlendMode>()> descs_;

};

_DXOBJECT_NAMESPACE_END
