#include "GameScene.h"

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* engine
#include <Engine/System/SxavengerSystem.h>

//* lib
#include <Lib/Environment.h>

////////////////////////////////////////////////////////////////////////////////////////////
// GameScene class methods
////////////////////////////////////////////////////////////////////////////////////////////

void GameScene::Run() {

	//-----------------------------------------------------------------------------------------
	// 初期化処理
	//-----------------------------------------------------------------------------------------
	Init();

	//-----------------------------------------------------------------------------------------
	// ゲームループ
	//-----------------------------------------------------------------------------------------
	while (SxavengerSystem::ProcessMessage()) {

		//-----------------------------------------------------------------------------------------
		// 更新処理
		//-----------------------------------------------------------------------------------------

		Update();

		//-----------------------------------------------------------------------------------------
		// 描画処理
		//-----------------------------------------------------------------------------------------

		Draw();

		/*if (false) {
			break;
		}*/
	}

	//-----------------------------------------------------------------------------------------
	// 終了処理
	//-----------------------------------------------------------------------------------------

	Term();

}

void GameScene::Init() {
	mainWindow_ = SxavengerSystem::CreateMainWindow(kMainWindowSize, kMainWindowTitle);
	mainWindow_->SetIcon("resources/icon/SxavengerEngineIcon.ico", { 32, 32 });

	input_.Create(3, 3);
	(*input_.GetVertex())[0] = { 0.0f, 0.1f, 0.0f };
	(*input_.GetVertex())[1] = { 0.1f, -0.1f, 0.0f };
	(*input_.GetVertex())[2] = { -0.1f, -0.1f, 0.0f };

	(*input_.GetIndex())[0] = 0;
	(*input_.GetIndex())[1] = 1;
	(*input_.GetIndex())[2] = 2;


}

void GameScene::Update() {
	SxavengerSystem::TransitionAllocator();
}

void GameScene::Draw() {

	mainWindow_->BeginRendering();
	mainWindow_->ClearWindow();

	mainWindow_->EndRendering();

	SxavengerSystem::PresentAllWindow();
}

void GameScene::Term() {
	SxavengerSystem::ExecuteAllAllocator();
}


