//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
#include "DecalPass.hlsli"

//=========================================================================================
// buffers
//=========================================================================================

//=========================================================================================
// constant variables
//=========================================================================================

//!< Cubeの描画.

static const float3 kVertices[8] = {
	float3( 0.5f,  0.5f, -0.5f), // 0
	float3( 0.5f, -0.5f, -0.5f), // 1
	float3( 0.5f,  0.5f,  0.5f), // 2
	float3( 0.5f, -0.5f,  0.5f), // 3
	float3(-0.5f,  0.5f, -0.5f), // 4
	float3(-0.5f, -0.5f, -0.5f), // 5
	float3(-0.5f,  0.5f,  0.5f), // 6
	float3(-0.5f, -0.5f,  0.5f), // 7
};

static const uint kIndices[36] = {

	// +Y
	0, 4, 6,
	0, 6, 2,

	// +Z
	3, 2, 6,
	3, 6, 7,

	// -X
	7, 6, 4,
	7, 4, 5,

	// -Y
	5, 1, 3,
	5, 3, 7,

	// +X
	1, 0, 2,
	1, 2, 3,

	// -Z
	5, 4, 0,
	5, 0, 1,
};

static float4 GetPosition(uint vertexId, float3 size = float3(1.0f, 1.0f, 1.0f)) {
	return float4(kVertices[kIndices[vertexId]] * size, 1.0f);
}

////////////////////////////////////////////////////////////////////////////////////////////
// main
////////////////////////////////////////////////////////////////////////////////////////////
DecalPSInput main(uint vertexId : SV_VertexID) { //!< 制約: vertexIdを36で起動する.

	DecalPSInput output = (DecalPSInput)0;

	output.position = mul(gTransform.Transform(GetPosition(vertexId)), kViewProj);
	output.clip     = output.position.z; //!< near分のclip

	return output;
	
}
