#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* base
#include <Engine/Beta/BaseBehavior.h>

//* lib
#include <Lib/Geometry/Vector3.h>

////////////////////////////////////////////////////////////////////////////////////////////
// PlayerBullet class
////////////////////////////////////////////////////////////////////////////////////////////
class PlayerBullet //!< レーザーを想定
	: public BaseBehavior {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	PlayerBullet()  = default;
	~PlayerBullet() { Term(); }

	void Init();

	void Term();

	void Update();

	void SetAttributeImGui() override;

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	//* parameter *//

	Vector3f direction_ = { 0.0f, 0.0f, 1.0f };

	float maxEnergy_          = 1.0f;       //!< エネルギーの最大数
	float energyLossRate_     = 0.1f;       //!< エネルギーの減少量(1秒間での)
	float energyRecoveryRate_ = 0.1f;       //!< エネルギーの増加量(1秒間での)
	float energy_             = maxEnergy_; //!< 計測用

};