#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* content
#include "BaseContent.h"

//* engine
#include <Engine/Foundation.h>
#include <Engine/System/DirectX/Context/DirectXQueueContext.h>

//* lib
#include <Lib/Adapter/Uuid/Uuid.h>

//* DirectX12
#include <d3dx12.h>
#include <DirectXTex.h>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// Content namespace
////////////////////////////////////////////////////////////////////////////////////////////
namespace Content {

	////////////////////////////////////////////////////////////////////////////////////////////
	// Texture class
	////////////////////////////////////////////////////////////////////////////////////////////
	class Texture final
		: public BaseContent {
	public:

		////////////////////////////////////////////////////////////////////////////////////////////
		// Encoding enum class
		////////////////////////////////////////////////////////////////////////////////////////////
		enum class Encoding : bool {
			Lightness, //!< sRGB
			Intensity, //!< Linear
		};

		////////////////////////////////////////////////////////////////////////////////////////////
		// Option structure
		////////////////////////////////////////////////////////////////////////////////////////////
		struct Option {
		public:

			//=========================================================================================
			// public variables
			//=========================================================================================

			Encoding encoding = Encoding::Lightness;
			//!< 読み込み時のエンコード形式の指定. LightnessはsRGB形式(Albedo etc...), IntensityはLinear形式で読み込む.(Normal etc...)

			bool isGenerateMipmap = true;
			bool useCompress      = true; //!< 圧縮されたテクスチャを使用するかどうか. 圧縮されたテクスチャが存在しない場合は、通常のテクスチャを使用する.

		};

	public:

		//=========================================================================================
		// public methods
		//=========================================================================================

		Texture() : BaseContent(Async::Execution::Copy) {}
		~Texture() = default;

		//* content option *//

		void Attach(const std::filesystem::path& filepath, const std::any& parameter) override;

		void Load(MAYBE_UNUSED const DirectXQueueContext* context) override;

	private:

		//=========================================================================================
		// private variables
		//=========================================================================================

		Uuid id_;

		//=========================================================================================
		// private methods
		//=========================================================================================

		void AttachUuid(const std::filesystem::path& filepath);

	};

}

SXAVENGER_ENGINE_NAMESPACE_END
