//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
#include "Presenter.hlsli"

//=========================================================================================
// buffer
//=========================================================================================

Texture2D<float4> gTexture : register(t0);
SamplerState gSampler      : register(s0);

// todo: HDRの対応

////////////////////////////////////////////////////////////////////////////////////////////
// main
////////////////////////////////////////////////////////////////////////////////////////////
[earlydepthstencil]
PSOutput main(PSInput input) {
	
	PSOutput output = (PSOutput)0;
	
	float4 color = gTexture.Sample(gSampler, input.texcoord);
	
	output.color = saturate(color); //!< HDRの対応までの暫定処理

	return output;
}
