#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* lib
#include <Lib/Adapter/Uuid/Uuid.h>

//* c++
#include <concepts>
#include <optional>
#include <thread>

////////////////////////////////////////////////////////////////////////////////////////////
// UBaseAsset class
////////////////////////////////////////////////////////////////////////////////////////////
class UBaseAsset {
public:

	////////////////////////////////////////////////////////////////////////////////////////////
	// Status enum class
	////////////////////////////////////////////////////////////////////////////////////////////
	enum class Status : uint8_t {
		None,     //!< 初期状態
		Complete, //!< Setupが完了した状態
	};

public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	UBaseAsset(const Uuid& id) : id_(id) {}
	UBaseAsset(const std::nullopt_t&) : id_(std::nullopt) {}
	virtual ~UBaseAsset() = default;

	bool HasId() const { return id_.has_value(); }

	const Uuid& GetId() const { return id_.value(); } //!< todo exceptionの追加

	bool IsComplete() const { return status_ == Status::Complete; }

protected:

	//=========================================================================================
	// protected variables
	//=========================================================================================

	Status status_ = Status::None;

	//=========================================================================================
	// protected methods
	//=========================================================================================

	void Complete() { status_ = Status::Complete; }

	void WaitComplete() const {
		while (!IsComplete()) {
			std::this_thread::sleep_for(std::chrono::milliseconds(1)); //!< 完了を待つ
		}
	}

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	const std::optional<Uuid> id_;

};

////////////////////////////////////////////////////////////////////////////////////////////
// concept
////////////////////////////////////////////////////////////////////////////////////////////
template <class T>
concept UAssetConcept = std::derived_from<T, UBaseAsset> && !std::is_same_v<T, UBaseAsset>;
