#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* collider
#include "ColliderComponent.h"

//* engine
#include <Engine/Foundation.h>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// CollisionHelper class
////////////////////////////////////////////////////////////////////////////////////////////
//! @brief 衝突判定補助クラス
class CollisionHelper {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	static Vector3f PushBackAABB(ColliderComponent* target, ColliderComponent* source);

	// TODO: 押し戻し計算をCallbackの引数にする.
private:
};

SXAVENGER_ENGINE_NAMESPACE_END
