#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
// Geometry
#include <Vector2.h>
#include <Vector3.h>
#include <Matrix4x4.h>

////////////////////////////////////////////////////////////////////////////////////////////
// Camera2D class
////////////////////////////////////////////////////////////////////////////////////////////
class Camera2D { //!< Matrix3x3のカメラと名前がかぶる...
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	//! @brief コンストラクタ
	Camera2D();

	//! @brief デストラクタ
	~Camera2D();

	void Init();

	void SetProjection(float left, float top, float right, float bottom, float nearClip, float farClip);

	const Matrix4x4& GetProjectionMatrix() const { return projectionMantrix_; }

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	// viewMatrixはカメラを動かさない場合, 単位行列になるので作ってない

	Matrix4x4 projectionMantrix_;
};