#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* post process
#include "BasePostProcess.h"

//* engine
#include <Engine/Foundation.h>
#include <Engine/System/DirectX/DxObject/DxDimensionBuffer.h>

//* c++
#include <memory>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// PostProcessPostFx class
////////////////////////////////////////////////////////////////////////////////////////////
//! @brief 明度/彩度/色の鮮やかさ等を調整する基本ポストプロセス
class PostProcessPostFx
	: public BasePostProcess {
public:

	////////////////////////////////////////////////////////////////////////////////////////////
	// Parameter structure
	////////////////////////////////////////////////////////////////////////////////////////////
	//! @brief このエフェクトのパラメータを保持する構造体
	struct Parameter {

		//=========================================================================================
		// public methods
		//=========================================================================================

		static Parameter Default();

		//=========================================================================================
		// public variables
		//=========================================================================================

		float brightness;   //!< 輝度 [-1.0 ~ 1.0]
		float saturation;   //!< 飽和度 [-1.0 ~ 1.0]
		float colorfulness; //!< 彩度 [0.0 ~ 1.0]
		float clarity;      //!< 明瞭度 [0.0 ~ 1.0]
		float lumaSharpen;  //!< [0.0 ~ 1.0]

	};

public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	void Init() override;

	void Process(const DirectXQueueContext* context, const ProcessInfo& info) override;

	void ShowInspectorImGui() override;

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	DxObject::ConstantBuffer<Parameter> parameter_;

};

SXAVENGER_ENGINE_NAMESPACE_END
