#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* engine
#include <Engine/Foundation.h>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN

////////////////////////////////////////////////////////////////////////////////////////////
// FBaseRenderCore class
////////////////////////////////////////////////////////////////////////////////////////////
//! @brief 描画機能ごとのパイプライン(PSO/RootSignature等)を保持するRenderCoreの基底クラス
class FBaseRenderCore {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	FBaseRenderCore()          = default;
	virtual ~FBaseRenderCore() = default;

	//! @brief パイプライン等を初期化する (派生クラスで実装)
	virtual void Init() = 0;

private:
};

SXAVENGER_ENGINE_NAMESPACE_END
